Lazarus/axisDeer/rkoa.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Header>
		<m:RaboHeader xmlns:m="http://www.rabobank.nl/XMLHeader/10">
			<m:HeaderVersion>String</m:HeaderVersion>
			<m:MessageId>String</m:MessageId>
			<m:ServiceRequestorDomain>String</m:ServiceRequestorDomain>
			<m:ServiceRequestorId>String</m:ServiceRequestorId>
			<m:ServiceProviderDomain>String</m:ServiceProviderDomain>
			<m:ServiceId>String</m:ServiceId>
			<m:ServiceVersion>Str</m:ServiceVersion>
			<m:FaultIndication>True</m:FaultIndication>
			<m:MessageTimestamp>2001-12-17T09:30:47.0Z</m:MessageTimestamp>
		</m:RaboHeader>
		<m:RaboHeader xmlns:m="http://www.rabobank.nl/XMLHeader/10">
			<m:HeaderVersion>String</m:HeaderVersion>
			<m:MessageId>String</m:MessageId>
			<m:ServiceRequestorDomain>String</m:ServiceRequestorDomain>
			<m:ServiceRequestorId>String</m:ServiceRequestorId>
			<m:ServiceProviderDomain>String</m:ServiceProviderDomain>
			<m:ServiceId>String</m:ServiceId>
			<m:ServiceVersion>Str</m:ServiceVersion>
			<m:FaultIndication>True</m:FaultIndication>
			<m:MessageTimestamp>2001-12-17T09:30:47.0Z</m:MessageTimestamp>
		</m:RaboHeader>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<m:RaadplegenKlantenOpAdres_Req xmlns:m="http://www.rabobank.nl/CRM/CRMI/RaadplegenKlantenOpAdres/1/Req">
			<m:KlantId>String</m:KlantId>
		</m:RaadplegenKlantenOpAdres_Req>
		<m:RaadplegenKlantenOpAdres_Rpy xmlns:m="http://www.rabobank.nl/CRM/CRMI/RaadplegenKlantenOpAdres/1/Rpy">
			<m:Huishouden>
				<m:Klant>
					<m:KlantId>String</m:KlantId>
					<m:IKBNummer>String</m:IKBNummer>
					<m:Achternaam>String</m:Achternaam>
					<m:Voorletters>String</m:Voorletters>
					<m:Geslacht>String</m:Geslacht>
					<m:GeboorteDatum>1967-08-13</m:GeboorteDatum>
				</m:Klant>
			</m:Huishouden>
			<m:OverigeBewoners>
				<m:Bewoner>
					<m:KlantId>String</m:KlantId>
					<m:IKBNummer>String</m:IKBNummer>
					<m:KlantType>String</m:KlantType>
					<m:NatuurlijkPersoon>
						<m:Achternaam>String</m:Achternaam>
						<m:Voorletters>String</m:Voorletters>
						<m:Geslacht>String</m:Geslacht>
						<m:GeboorteDatum>1967-08-13</m:GeboorteDatum>
					</m:NatuurlijkPersoon>
					<m:Organisatie>
						<m:Verkortenaam>String</m:Verkortenaam>
					</m:Organisatie>
				</m:Bewoner>
			</m:OverigeBewoners>
		</m:RaadplegenKlantenOpAdres_Rpy>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
